# Analytical Transformer Data Class

Source: https://www.revitapidocs.com/2026/a4235b4c-ad58-bb3f-e697-2e7ba5bef5ea.htm

---

| Analytical Transformer Data Class |
| --- |

Represents the data and parameters of analytical transformer node. Inheritance Hierarchy System Object
Autodesk.Revit.DB.Electrical AnalyticalDistributionNodePropertyData
Autodesk.Revit.DB.Electrical AnalyticalPowerDistributableNodeData
Autodesk.Revit.DB.Electrical AnalyticalTransformerData

**Namespace:** Autodesk.Revit.DB.Electrical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public class AnalyticalTransformerData : AnalyticalPowerDistributableNodeData
```

```
Public Class AnalyticalTransformerData
	Inherits AnalyticalPowerDistributableNodeData
```

```
public ref class AnalyticalTransformerData : public AnalyticalPowerDistributableNodeData
```

```
type AnalyticalTransformerData =
    class
        inherit AnalyticalPowerDistributableNodeData
    end
```
The AnalyticalTransformerData type exposes the following members.

Properties

|  | Name | Description |
| --- | --- | --- |
|  | ApparentPowerRating | The apparent power rating value of the analytical transformer. |
|  | AssignedPhasesNumber | The number of electrical phases assigned through the distribution system of the power distributable node. (Inherited from AnalyticalPowerDistributableNodeData ) |
|  | AssignedVoltage | The voltage assigned through the distribution system of the power distributable node. (Inherited from AnalyticalPowerDistributableNodeData ) |
|  | ConnectedPhases | The electrical connected phases of the electrical analytical node to its upstream node. (Inherited from AnalyticalDistributionNodePropertyData ) |
|  | DistributionSystem | The distribution system of the power distributable node. (Inherited from AnalyticalPowerDistributableNodeData ) |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from AnalyticalDistributionNodePropertyData ) |
|  | SecondaryDistributionSystem | The secondary distribution system of the analytical transformer. |

Top Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | (Inherited from AnalyticalDistributionNodePropertyData ) |
|  | Equals | Determines whether the specified object is equal to the current object. (Inherited from Object ) |
|  | GetAllAvailableConnectedPhasesOnDownstream | Get all the available electrical connected phases that this power distributable node can provide to the downstream node. (Inherited from AnalyticalPowerDistributableNodeData ) |
|  | GetApparentPerPhaseResults | Get an ElectricalPerPhaseData which contains each electrical phase's apparent load and apprent current of the power distributable node. (Inherited from AnalyticalPowerDistributableNodeData ) |
|  | GetConnectedPhasesOnDownstream | Get the electrical connected phases of the downstream node. (Inherited from AnalyticalPowerDistributableNodeData ) |
|  | GetDemandPerPhaseResults | Get an ElectricalPerPhaseData which contains each electrical phase's demand load and demand current of the power distributable node. (Inherited from AnalyticalPowerDistributableNodeData ) |
|  | GetHashCode | Serves as the default hash function. (Inherited from Object ) |
|  | GetType | Gets the Type of the current instance. (Inherited from Object ) |
|  | SetConnectedPhasesOnDownstream | Set the electrical connected phases of the downstream node. (Inherited from AnalyticalPowerDistributableNodeData ) |
|  | ToString | Returns a string that represents the current object. (Inherited from Object ) |

Top See Also

#### Reference

Autodesk.Revit.DB.Electrical Namespace